app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Comp Sci"], ["room_number", 5], ["created_at", "2019-07-01 19:09:31.142244"], ["updated_at", "2019-07-01 19:09:31.142244"]]
---
    def create
        @school_class = SchoolClass.create(title: params[:school_class_title], room_number: params[:school_class_room_number])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @schoolclass = SchoolClass.find(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["id", 1]]
---
    def update
        @schoolclass = SchoolClass.find(params[:id])
        @schoolclass.update(title: params[:school_class_title], room_number: params[:school_class_room_number])