app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-06-28 14:33:53.740924"], ["updated_at", "2019-06-28 14:33:53.740924"]]
---
    def create
        @student = Student.create(first_name: params[:student_first_name], last_name: params[:student_last_name])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        # byebug
        @student = Student.find(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-06-28 17:55:45.147404"], ["id", 1]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(first_name: params[:student_first_name], last_name: params[:student_last_name])